# SlabShapeWarnVerticesDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlabShapeWarnVerticesDeleted Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
Some slab shape edit vertices were deleted because the Floor or Roof or Toposolid has changed its shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlabShapeWarnVerticesDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeWarnVerticesDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlabShapeWarnVerticesDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace